"""
Γράψτε ένα κώδικα σε Python ο οποίος να παίρνει σαν είσοδο ένα αρχείο ASCII
κειμένου και μετατρέπει τον κάθε χαρακτήρα του στον “κατοπτρικό” του χαρακτήρα
ASCII. Κατοπτρικοί χαρακτήρες είναι αυτοί των οποίων το άθροισμα είναι 128.
Εμφανίστε το κατοπτρικό κείμενο στο χρήστη με ανάποδη σειρά χαρακτήρων.
"""
#άνοιγμα του αρχείου ascii
try:
    file = open(input("Δώσε αρχείο:"), "r")
except FileNotFoundError:
    print("Το αρχειό δεν υπάρχει. Προσπαθήστε ξανά.")
    exit(1)
#μετατροπή file σε string
#reverse string
s = file.read().replace("\n", " ")
s = s[::-1]
file.close()

#κατοπτρικό του αντεστραμένου string
new_s=''
for x in s:
    new_s+=chr(128-ord(x))

print(new_s)
